import { openai } from './textEmbedding';

export const checkOwnerInfo = async (userInfo: string, queryText: string) => {
  const prompt = `
Та шалгаарай:
Хэрэглэгчийн мэдээлэл нь  "${userInfo}" байна.
Асуулт: "${queryText}"

Дүрэм:
1. Хэрэв асуултанд "email", "имэйл", "албан тушаал", "хэлтэс","нэр" зэрэг ажил, байгууллагатай холбоотой мэдээллийг асуусан бол тухайн хүн өөрөө эсвэл өөр хүн байсан ч "OWN" гэж үзнэ.
2. Хэрэв асуулт нь байгууллагын тухай (компанийн дүрэм журам, нийт ажилчдын тоо, байгууллагын бүтэц зэрэг) бол "OWN" гэж үзнэ.
3. Хэрэв асуулт нь өөр хүний хувийн мэдээлэл (гэрийн хаяг, хувийн утас, гэр бүл гэх мэт,цалин, ажилласан жил) асууж байвал "OTHER" гэж үзнэ.
4. Хэрэв асуулт нь өөрийн хувийн мэдээлэл (гэрийн хаяг, хувийн утас, гэр бүл гэх мэт,цалин, ажилласан жил) асууж байвал "OWN" гэж үзнэ.
5. Хэрэв өөр хүний мэдээлэл авах зорилгогүй бол асуулт бол "OWN" гэж үзнэ.
5. Хэрэв асуулт нь мэндчилгээний үг ("сайн уу?" , "сайн байна уу?" , hi , hello гэх мэт) байвал "HELLO" гэж үзнэ
6. Хэрэв хэрэглэгчийн role нь (hr or admin) байвал "OWN" гэж үзнэ.
7. Хэрэв байгууллагын тухай (компанийн дүрэм журам, нийт ажилчдын тоо, байгууллагын бүтэц зэрэг) мэдээлэл болон хувь хүний талаарх асуулт биш бол "HELLO" гэж үзнэ.
8. Хариултыг зөвхөн "OWN", "HELLO" эсвэл "OTHER" гэж өгнө.
`;

  const response = await openai.chat.completions.create({
    model: 'gpt-4o',
    messages: [{ role: 'user', content: prompt }],
    temperature: 0,
  });

  const answer = response.choices[0].message?.content?.trim();
  return answer;
};
